onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КЮ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КЮ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КЮ_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ++ Кузьменко Юрий, 28.03.2026 
	КЮ_КонтактныеЛицаСервер.ДобавитьПолеВыбора(ЭтотОбъект, Элементы.ГруппаШапкаПраво);
	КЮ_ДобавитьЭлементыСкидкиНаФорму();
	// -- Кузьменко Юрий, 28.03.2026

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)

	// ++ Кузьменко Юрий, 28.03.2026 
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	КЮ_РассчитатьСуммуСтроки(ТекущиеДанные);
	// -- Кузьменко Юрий, 28.03.2026
	
	РассчитатьСуммуДокумента();	

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

// ++ КузьменкоЮрий, 28.03.2026
#Область СогласованнаяСкидка

&НаКлиенте
Процедура КЮ_РассчитатьСуммуСтроки(ТекущиеДанные, ИмяТаблицы = Неопределено)

	СуммаБезСкидки = ТекущиеДанные.Цена * ТекущиеДанные.Количество;

	ПроцентСкидки = Объект.КЮ_СогласованнаяСкидка + ТекущиеДанные.Скидка;
	Если ПроцентСкидки > 100 Тогда
		КЮ_СообщитьОПревышенииПроцентаСкидки(ТекущиеДанные, ПроцентСкидки, ИмяТаблицы);
		ПроцентСкидки = 100;
	КонецЕсли;

	СуммаСкидки = СуммаБезСкидки * ПроцентСкидки / 100;
	ТекущиеДанные.Сумма = СуммаБезСкидки - СуммаСкидки;

КонецПроцедуры

&НаКлиенте
Процедура КЮ_ПересчитатьТаблицыДокумента()

	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		КЮ_РассчитатьСуммуСтроки(СтрокаТовара, "Товары");
	КонецЦикла;

	Для Каждого СтрокаУслуги Из Объект.Услуги Цикл
		КЮ_РассчитатьСуммуСтроки(СтрокаУслуги, "Услуги");
	КонецЦикла;

	РассчитатьСуммуДокумента();

КонецПроцедуры

&НаКлиенте
Процедура КЮ_СогласованнаяСкидкаПриИзменении(Элемент)

	КоличествоСтрокДокумента = Объект.Товары.Количество() + Объект.Услуги.Количество();
	Если КоличествоСтрокДокумента > 0 Тогда
		КЮ_ПересчитатьТаблицыДокументаСВопросом();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура КЮ_ПересчитатьТаблицыДокументаСВопросом()

	ТекстВопроса = "Изменен процент скидки. Пересчитать таблицы товаров и услуг?";
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		КЮ_ПересчитатьТаблицыДокумента();
	КонецЕсли;

КонецПроцедуры

// Обработчик команды программно добавляемой на форму в методе КЮ_ДобавитьЭлементыСкидкиНаФорму.
// 
// Параметры:
//   Команда - КомандаФормы
//
&НаКлиенте
Процедура КЮ_ПересчитатьТаблицы(Команда)

	КЮ_ПересчитатьТаблицыДокумента();

КонецПроцедуры

&НаСервере
Процедура КЮ_ДобавитьЭлементыСкидкиНаФорму()

	ЭлементРодитель = Элементы.ГруппаШапкаЛево;

	// Группа формы для размещения элементов работы со скидкой
	ГруппаСогласованнаяСкидка = Элементы.Вставить("КЮ_ГруппаСогласованнаяСкидка", Тип("ГруппаФормы"), ЭлементРодитель);
	ГруппаСогласованнаяСкидка.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаСогласованнаяСкидка.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаСогласованнаяСкидка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаСогласованнаяСкидка.ОтображатьЗаголовок = Ложь;

	// Поле ввода процента скидки
	ПолеСогласованнаяСкидка = Элементы.Вставить("КЮ_СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаСогласованнаяСкидка);
	ПолеСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСогласованнаяСкидка.Заголовок = "Согласованная скидка";
	ПолеСогласованнаяСкидка.ПутьКДанным = "Объект.КЮ_СогласованнаяСкидка";
	ПолеСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "КЮ_СогласованнаяСкидкаПриИзменении"); 
	
	// Кнопка пересчета таблиц документа
	КомандаПересчетаТаблиц = Команды.Добавить("КЮ_ПересчитатьТаблицы");
	КомандаПересчетаТаблиц.Заголовок = "Пересчитать таблицы";
	КомандаПересчетаТаблиц.Действие = "КЮ_ПересчитатьТаблицы";
	КомандаПересчетаТаблиц.Картинка = БиблиотекаКартинок.Обновить;
	КомандаПересчетаТаблиц.Отображение = ОтображениеКнопки.КартинкаИТекст;

	КнопкаПересчетаТаблиц = Элементы.Вставить("КЮ_ПересчитатьСуммуДокумента", Тип("КнопкаФормы"), ГруппаСогласованнаяСкидка);
	КнопкаПересчетаТаблиц.ИмяКоманды = "КЮ_ПересчитатьТаблицы";

КонецПроцедуры

// Выводит сообщение о превышении процента скидки по строке с привязкой к элементу формы.
// 
// Параметры:
//  ТекущиеДанные - ДанныеФормыЭлементКоллекции - Текущие данные:
//   * НомерСтроки - Число - Номер строки табличной части.
//   * Номенклатура - СправочникСсылка.Номенклатура - Номенклатура.
//   * Количество - Число - количество товаров/услуг.
//   * Цена - Число - цена единцы товара/услуги.
///  * Скидка - Число - процент скидки по строке.
//   * Сумма - Число - итоговая сумма по строке табличной части.
//  ПроцентСкидки - Число - Процент согласованой скидки по документу.
//  ИмяТаблицы - Неопределено, Строка - имя таблицы формы "Товары"/"Услуги".
&НаКлиенте
Процедура КЮ_СообщитьОПревышенииПроцентаСкидки(ТекущиеДанные, ПроцентСкидки, ИмяТаблицы = Неопределено)

	Если ИмяТаблицы = Неопределено Тогда
		ИмяТаблицы = ТекущийЭлемент.Имя;
	КонецЕсли;

	ШаблонСообщения = "Суммарный процент скидки %1%% (согласованная %2%% + скидка по строке %3%%) в строке %4 превысил допустимый размер в 100%%";

	ТекстСообщения = СтрШаблон(ШаблонСообщения,
		ПроцентСкидки,
		Объект.КЮ_СогласованнаяСкидка,
		ТекущиеДанные.Скидка,
		ТекущиеДанные.НомерСтроки);

	 Поле = СтрШаблон("Объект.%1[%2].Скидка", ИмяТаблицы, Формат(ТекущиеДанные.НомерСтроки - 1, "ЧН=0; ЧГ="));

	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , Поле);

КонецПроцедуры

#КонецОбласти
// -- КузьменкоЮрий, 28.03.2026

#КонецОбласти
